Continued plan output from previous comment.
<details><summary>Show Output</summary>

```diff
= false
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: rbac.authorization.k8s.io/v1
            kind: ClusterRole
            metadata:
              name: kubero-operator-proxy-role
            rules:
            - apiGroups:
              - authentication.k8s.io
              resources:
              - tokenreviews
              verbs:
              - create
            - apiGroups:
              - authorization.k8s.io
              resources:
              - subjectaccessreviews
              verbs:
              - create
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # kubectl_manifest.kubero_operator[44] will be created
+ resource "kubectl_manifest" "kubero_operator" {
      + api_version             = "rbac.authorization.k8s.io/v1"
      + apply_only              = false
      + field_manager           = "kubectl"
      + force_conflicts         = true
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "RoleBinding"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "kubero-operator-leader-election-rolebinding"
      + namespace               = "kubero-operator-system"
      + server_side_apply       = true
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = false
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: rbac.authorization.k8s.io/v1
            kind: RoleBinding
            metadata:
              name: kubero-operator-leader-election-rolebinding
              namespace: kubero-operator-system
            roleRef:
              apiGroup: rbac.authorization.k8s.io
              kind: Role
              name: kubero-operator-leader-election-role
            subjects:
            - kind: ServiceAccount
              name: kubero-operator-controller-manager
              namespace: kubero-operator-system
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # kubectl_manifest.kubero_operator[45] will be created
+ resource "kubectl_manifest" "kubero_operator" {
      + api_version             = "rbac.authorization.k8s.io/v1"
      + apply_only              = false
      + field_manager           = "kubectl"
      + force_conflicts         = true
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "ClusterRoleBinding"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "kubero-operator-manager-rolebinding"
      + namespace               = (known after apply)
      + server_side_apply       = true
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = false
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: rbac.authorization.k8s.io/v1
            kind: ClusterRoleBinding
            metadata:
              name: kubero-operator-manager-rolebinding
            roleRef:
              apiGroup: rbac.authorization.k8s.io
              kind: ClusterRole
              name: kubero-operator-manager-role
            subjects:
            - kind: ServiceAccount
              name: kubero-operator-controller-manager
              namespace: kubero-operator-system
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # kubectl_manifest.kubero_operator[46] will be created
+ resource "kubectl_manifest" "kubero_operator" {
      + api_version             = "rbac.authorization.k8s.io/v1"
      + apply_only              = false
      + field_manager           = "kubectl"
      + force_conflicts         = true
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "ClusterRoleBinding"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "kubero-operator-proxy-rolebinding"
      + namespace               = (known after apply)
      + server_side_apply       = true
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = false
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: rbac.authorization.k8s.io/v1
            kind: ClusterRoleBinding
            metadata:
              name: kubero-operator-proxy-rolebinding
            roleRef:
              apiGroup: rbac.authorization.k8s.io
              kind: ClusterRole
              name: kubero-operator-proxy-role
            subjects:
            - kind: ServiceAccount
              name: kubero-operator-controller-manager
              namespace: kubero-operator-system
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # kubectl_manifest.kubero_operator[47] will be created
+ resource "kubectl_manifest" "kubero_operator" {
      + api_version             = "v1"
      + apply_only              = false
      + field_manager           = "kubectl"
      + force_conflicts         = true
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "ConfigMap"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "kubero-operator-manager-config"
      + namespace               = "kubero-operator-system"
      + server_side_apply       = true
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = false
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: v1
            data:
              controller_manager_config.yaml: |
                apiVersion: controller-runtime.sigs.k8s.io/v1alpha1
                kind: ControllerManagerConfig
                health:
                  healthProbeBindAddress: :8081
                metrics:
                  bindAddress: 127.0.0.1:8080
            
                leaderElection:
                  leaderElect: true
                  resourceName: 811c9dc5.kubero.dev
            kind: ConfigMap
            metadata:
              name: kubero-operator-manager-config
              namespace: kubero-operator-system
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # kubectl_manifest.kubero_operator[48] will be created
+ resource "kubectl_manifest" "kubero_operator" {
      + api_version             = "v1"
      + apply_only              = false
      + field_manager           = "kubectl"
      + force_conflicts         = true
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "Service"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "kubero-operator-controller-manager-metrics-service"
      + namespace               = "kubero-operator-system"
      + server_side_apply       = true
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = false
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: v1
            kind: Service
            metadata:
              labels:
                control-plane: controller-manager
              name: kubero-operator-controller-manager-metrics-service
              namespace: kubero-operator-system
            spec:
              ports:
              - name: https
                port: 8443
                protocol: TCP
                targetPort: https
              selector:
                control-plane: controller-manager
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # kubectl_manifest.kubero_operator[49] will be created
+ resource "kubectl_manifest" "kubero_operator" {
      + api_version             = "apps/v1"
      + apply_only              = false
      + field_manager           = "kubectl"
      + force_conflicts         = true
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "Deployment"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "kubero-operator-controller-manager"
      + namespace               = "kubero-operator-system"
      + server_side_apply       = true
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = false
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: apps/v1
            kind: Deployment
            metadata:
              labels:
                control-plane: controller-manager
              name: kubero-operator-controller-manager
              namespace: kubero-operator-system
            spec:
              replicas: 1
              selector:
                matchLabels:
                  control-plane: controller-manager
              template:
                metadata:
                  annotations:
                    kubectl.kubernetes.io/default-container: manager
                  labels:
                    control-plane: controller-manager
                spec:
                  containers:
                  - args:
                    - --secure-listen-address=0.0.0.0:8443
                    - --upstream=http://127.0.0.1:8080/
                    - --logtostderr=true
                    - --v=0
                    image: gcr.io/kubebuilder/kube-rbac-proxy:v0.11.0
                    name: kube-rbac-proxy
                    ports:
                    - containerPort: 8443
                      name: https
                      protocol: TCP
                    resources:
                      limits:
                        cpu: 500m
                        memory: 128Mi
                      requests:
                        cpu: 5m
                        memory: 64Mi
                  - args:
                    - --health-probe-bind-address=:8081
                    - --metrics-bind-address=127.0.0.1:8080
                    - --leader-elect
                    - --leader-election-id=kubero-operator
                    - --zap-log-level=info
                    image: ghcr.io/kubero-dev/kubero-operator/kuberoapp:v0.2.2
                    livenessProbe:
                      httpGet:
                        path: /healthz
                        port: 8081
                      initialDelaySeconds: 15
                      periodSeconds: 20
                    name: manager
                    readinessProbe:
                      httpGet:
                        path: /readyz
                        port: 8081
                      initialDelaySeconds: 5
                      periodSeconds: 10
                    resources:
                      limits:
                        cpu: 1000m
                        memory: 1Gi
                      requests:
                        cpu: 100m
                        memory: 64Mi
                    securityContext:
                      allowPrivilegeEscalation: false
                  securityContext:
                    runAsNonRoot: true
                  serviceAccountName: kubero-operator-controller-manager
                  terminationGracePeriodSeconds: 10
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # kubernetes_namespace.kubero will be created
+ resource "kubernetes_namespace" "kubero" {
      + id                               = (known after apply)
      + wait_for_default_service_account = false

      + metadata {
          + generation       = (known after apply)
          + labels           = {
              + "layer" = "L4"
            }
          + name             = "kubero"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # kubernetes_namespace.kubero_operator_system will be created
+ resource "kubernetes_namespace" "kubero_operator_system" {
      + id                               = (known after apply)
      + wait_for_default_service_account = false

      + metadata {
          + generation       = (known after apply)
          + labels           = {
              + "control-plane" = "controller-manager"
              + "layer"         = "L4"
            }
          + name             = "kubero-operator-system"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # random_id.kubero_session_secret will be created
+ resource "random_id" "kubero_session_secret" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 32
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

  # terraform_data.production_safety_check will be created
+ resource "terraform_data" "production_safety_check" {
      + id = (known after apply)
    }

Plan: 55 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+ kubero_session_secret = (sensitive value)
+ kubero_ui_url         = "https://kcloud.zitian.party"
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -p apps-prod`
* :put_litter_in_its_place: To **delete** this plan click [here](https://atlantis.zitian.party/lock?id=wangzitian0%252Finfra%252F4.apps%252Fprod)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -p apps-prod`
</details>
Plan: 55 to add, 0 to change, 0 to destroy.

---
### 2. project: `apps-staging` dir: `4.apps` workspace: `staging`
<details><summary>Show Output</summary>

```diff
infra-flash-commit:b48a2cc


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # kubectl_manifest.kubero_instance will be created
+ resource "kubectl_manifest" "kubero_instance" {
      + api_version             = (known after apply)
      + apply_only              = false
      + field_manager           = "kubectl"
      + force_conflicts         = true
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = (known after apply)
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = (known after apply)
      + namespace               = (known after apply)
      + server_side_apply       = true
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = true
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = (known after apply)
      + yaml_incluster          = (sensitive value)
    }

  # kubectl_manifest.kubero_operator[0] will be created
+ resource "kubectl_manifest" "kubero_operator" {
      + api_version             = "apiextensions.k8s.io/v1"
      + apply_only              = false
      + field_manager           = "kubectl"
      + force_conflicts         = true
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "CustomResourceDefinition"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "kuberoaddonmemcacheds.application.kubero.dev"
      + namespace               = (known after apply)
      + server_side_apply       = true
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = false
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: apiextensions.k8s.io/v1
            kind: CustomResourceDefinition
            metadata:
              name: kuberoaddonmemcacheds.application.kubero.dev
            spec:
              group: application.kubero.dev
              names:
                kind: KuberoAddonMemcached
                listKind: KuberoAddonMemcachedList
                plural: kuberoaddonmemcacheds
                singular: kuberoaddonmemcached
              scope: Namespaced
              versions:
              - name: v1alpha1
                schema:
                  openAPIV3Schema:
                    description: KuberoAddonMemcached is the Schema for the kuberoaddonmemcacheds
                      API
                    properties:
                      apiVersion:
                        description: 'APIVersion defines the versioned schema of this representation
                          of an object. Servers should convert recognized schemas to the latest
                          internal value, and may reject unrecognized values. More info: https://git.k8s.io/community/contributors/devel/sig-architecture/api-conventions.md#resources'
                        type: string
                      kind:
                        description: 'Kind is a string value representing the REST resource this
                          object represents. Servers may infer this from the endpoint the client
                          submits requests to. Cannot be updated. In CamelCase. More info: https://git.k8s.io/community/contributors/devel/sig-architecture/api-conventions.md#types-kinds'
                        type: string
                      metadata:
                        type: object
                      spec:
                        description: Spec defines the desired state of KuberoAddonMemcached
                        type: object
                        x-kubernetes-preserve-unknown-fields: true
                      status:
                        description: Status defines the observed state of KuberoAddonMemcached
                        type: object
                        x-kubernetes-preserve-unknown-fields: true
                    type: object
                served: true
                storage: true
                subresources:
                  status: {}
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # kubectl_manifest.kubero_operator[1] will be created
+ resource "kubectl_manifest" "kubero_operator" {
      + api_version             = "apiextensions.k8s.io/v1"
      + apply_only              = false
      + field_manager           = "kubectl"
      + force_conflicts         = true
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "CustomResourceDefinition"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "kuberoaddonmongodbs.application.kubero.dev"
      + namespace               = (known after apply)
      + server_side_apply       = true
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = false
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: apiextensions.k8s.io/v1
            kind: CustomResourceDefinition
            metadata:
              name: kuberoaddonmongodbs.application.kubero.dev
            spec:
              group: application.kubero.dev
              names:
                kind: KuberoAddonMongodb
                listKind: KuberoAddonMongodbList
                plural: kuberoaddonmongodbs
                singular: kuberoaddonmongodb
              scope: Namespaced
              versions:
              - name: v1alpha1
                schema:
                  openAPIV3Schema:
                    description: KuberoAddonMongodb is the Schema for the kuberoaddonmongodbs
                      API
                    properties:
                      apiVersion:
                        description: 'APIVersion defines the versioned schema of this representation
                          of an object. Servers should convert recognized schemas to the latest
                          internal value, and may reject unrecognized values. More info: https://git.k8s.io/community/contributors/devel/sig-architecture/api-conventions.md#resources'
                        type: string
                      kind:
                        description: 'Kind is a string value representing the REST resource this
                          object represents. Servers may infer this from the endpoint the client
                          submits requests to. Cannot be updated. In CamelCase. More info: https://git.k8s.io/community/contributors/devel/sig-architecture/api-conventions.md#types-kinds'
                        type: string
                      metadata:
                        type: object
                      spec:
                        description: Spec defines the desired state of KuberoAddonMongodb
                        type: object
                        x-kubernetes-preserve-unknown-fields: true
                      status:
                        description: Status defines the observed state of KuberoAddonMongodb
                        type: object
                        x-kubernetes-preserve-unknown-fields: true
                    type: object
                served: true
                storage: true
                subresources:
                  status: {}
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # kubectl_manifest.kubero_operator[2] will be created
+ resource "kubectl_manifest" "kubero_operator" {
      + api_version             = "apiextensions.k8s.io/v1"
      + apply_only              = false
      + field_manager           = "kubectl"
      + force_conflicts         = true
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "CustomResourceDefinition"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "kuberoaddonmysqls.application.kubero.dev"
      + namespace               = (known after apply)
      + server_side_apply       = true
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = false
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: apiextensions.k8s.io/v1
            kind: CustomResourceDefinition
            metadata:
              name: kuberoaddonmysqls.application.kubero.dev
            spec:
              group: application.kubero.dev
              names:
                kind: KuberoAddonMysql
                listKind: KuberoAddonMysqlList
                plural: kuberoaddonmysqls
                singular: kuberoaddonmysql
              scope: Namespaced
              versions:
              - name: v1alpha1
                schema:
                  openAPIV3Schema:
                    description: KuberoAddonMysql is the Schema for the kuberoaddonmysqls API
                    properties:
                      apiVersion:
                        description: 'APIVersion defines the versioned schema of this representation
                          of an object. Servers should convert recognized schemas to the latest
                          internal value, and may reject unrecognized values. More info: https://git.k8s.io/community/contributors/devel/sig-architecture/api-conventions.md#resources'
                        type: string
                      kind:
                        description: 'Kind is a string value representing the REST resource this
                          object represents. Servers may infer this from the endpoint the client
                          submits requests to. Cannot be updated. In CamelCase. More info: https://git.k8s.io/community/contributors/devel/sig-architecture/api-conventions.md#types-kinds'
                        type: string
                      metadata:
                        type: object
                      spec:
                        description: Spec defines the desired state of KuberoAddonMysql
                        type: object
                        x-kubernetes-preserve-unknown-fields: true
                      status:
                        description: Status defines the observed state of KuberoAddonMysql
                        type: object
                        x-kubernetes-preserve-unknown-fields: true
                    type: object
                served: true
                storage: true
                subresources:
                  status: {}
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # kubectl_manifest.kubero_operator[3] will be created
+ resource "kubectl_manifest" "kubero_operator" {
      + api_version             = "apiextensions.k8s.io/v1"
      + apply_only              = false
      + field_manager           = "kubectl"
      + force_conflicts         = true
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "CustomResourceDefinition"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "kuberoaddonpostgres.application.kubero.dev"
      + namespace               = (known after apply)
      + server_side_apply       = true
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = false
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: apiextensions.k8s.io/v1
            kind: CustomResourceDefinition
            metadata:
              name: kuberoaddonpostgres.application.kubero.dev
            spec:
              group: application.kubero.dev
              names:
                kind: KuberoAddonPostgres
                listKind: KuberoAddonPostgresList
                plural: kuberoaddonpostgres
                singular: kuberoaddonpostgres
              scope: Namespaced
              versions:
              - name: v1alpha1
                schema:
                  openAPIV3Schema:
                    description: KuberoAddonPostgres is the Schema for the kuberoaddonpostgres
                      API
                    properties:
                      apiVersion:
                        description: 'APIVersion defines the versioned schema of this representation
                          of an object. Servers should convert recognized schemas to the latest
                          internal value, and may reject unrecognized values. More info: https://git.k8s.io/community/contributors/devel/sig-architecture/api-conventions.md#resources'
                        type: string
                      kind:
                        description: 'Kind is a string value representing the REST resource this
                          object represents. Servers may infer this from the endpoint the client
                          submits requests to. Cannot be updated. In CamelCase. More info: https://git.k8s.io/community/contributors/devel/sig-architecture/api-conventions.md#types-kinds'
                        type: string
                      metadata:
                        type: object
                      spec:
                        description: Spec defines the desired state of KuberoAddonPostgres
                        type: object
                        x-kubernetes-preserve-unknown-fields: true
                      status:
                        description: Status defines the observed state of KuberoAddonPostgres
                        type: object
                        x-kubernetes-preserve-unknown-fields: true
                    type: object
                served: true
                storage: true
                subresources:
                  status: {}
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # kubectl_manifest.kubero_operator[4] will be created
+ resource "kubectl_manifest" "kubero_operator" {
      + api_version             = "apiextensions.k8s.io/v1"
      + apply_only              = false
      + field_manager           = "kubectl"
      + force_conflicts         = true
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "CustomResourceDefinition"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "kuberoaddonrabbitmqs.application.kubero.dev"
      + namespace               = (known after apply)
      + server_side_apply       = true
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = false
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: apiextensions.k8s.io/v1
            kind: CustomResourceDefinition
            metadata:
              name: kuberoaddonrabbitmqs.application.kubero.dev
            spec:
              group: application.kubero.dev
              names:
                kind: KuberoAddonRabbitmq
                listKind: KuberoAddonRabbitmqList
                plural: kuberoaddonrabbitmqs
                singular: kuberoaddonrabbitmq
              scope: Namespaced
              versions:
              - name: v1alpha1
                schema:
                  openAPIV3Schema:
                    description: KuberoAddonRabbitmq is the Schema for the kuberoaddonrabbitmqs
                      API
                    properties:
                      apiVersion:
                        description: 'APIVersion defines the versioned schema of this representation
                          of an object. Servers should convert recognized schemas to the latest
                          internal value, and may reject unrecognized values. More info: https://git.k8s.io/community/contributors/devel/sig-architecture/api-conventions.md#resources'
                        type: string
                      kind:
                        description: 'Kind is a string value representing the REST resource this
                          object represents. Servers may infer this from the endpoint the client
                          submits requests to. Cannot be updated. In CamelCase. More info: https://git.k8s.io/community/contributors/devel/sig-architecture/api-conventions.md#types-kinds'
                        type: string
                      metadata:
                        type: object
                      spec:
                        description: Spec defines the desired state of KuberoAddonRabbitmq
                        type: object
                        x-kubernetes-preserve-unknown-fields: true
                      status:
                        description: Status defines the observed state of KuberoAddonRabbitmq
                        type: object
                        x-kubernetes-preserve-unknown-fields: true
                    type: object
                served: true
                storage: true
                subresources:
                  status: {}
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # kubectl_manifest.kubero_operator[5] will be created
+ resource "kubectl_manifest" "kubero_operator" {
      + api_version             = "apiextensions.k8s.io/v1"
      + apply_only              = false
      + field_manager           = "kubectl"
      + force_conflicts         = true
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "CustomResourceDefinition"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "kuberoaddonredis.application.kubero.dev"
      + namespace               = (known after apply)
      + server_side_apply       = true
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = false
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: apiextensions.k8s.io/v1
            kind: CustomResourceDefinition
            metadata:
              name: kuberoaddonredis.application.kubero.dev
            spec:
              group: application.kubero.dev
              names:
                kind: KuberoAddonRedis
                listKind: KuberoAddonRedisList
                plural: kuberoaddonredis
                singular: kuberoaddonredis
              scope: Namespaced
              versions:
              - name: v1alpha1
                schema:
                  openAPIV3Schema:
                    description: KuberoAddonRedis is the Schema for the kuberoaddonredis API
                    properties:
                      apiVersion:
                        description: 'APIVersion defines the versioned schema of this representation
                          of an object. Servers should convert recognized schemas to the latest
                          internal value, and may reject unrecognized values. More info: https://git.k8s.io/community/contributors/devel/sig-architecture/api-conventions.md#resources'
                        type: string
                      kind:
                        description: 'Kind is a string value representing the REST resource this
                          object represents. Servers may infer this from the endpoint the client
                          submits requests to. Cannot be updated. In CamelCase. More info: https://git.k8s.io/community/contributors/devel/sig-architecture/api-conventions.md#types-kinds'
                        type: string
                      metadata:
                        type: object
                      spec:
                        description: Spec defines the desired state of KuberoAddonRedis
                        type: object
                        x-kubernetes-preserve-unknown-fields: true
                      status:
                        description: Status defines the observed state of KuberoAddonRedis
                        type: object
                        x-kubernetes-preserve-unknown-fields: true
                    type: object
                served: true
                storage: true
                subresources:
                  status: {}
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # kubectl_manifest.kubero_operator[6] will be created
+ resource "kubectl_manifest" "kubero_operator" {
      + api_version             = "apiextensions.k8s.io/v1"
      + apply_only              = false
      + field_manager           = "kubectl"
      + force_conflicts         = true
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "CustomResourceDefinition"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "kuberoapps.application.kubero.dev"
      + namespace               = (known after apply)
      + server_side_apply       = true
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = false
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: apiextensions.k8s.io/v1
            kind: CustomResourceDefinition
            metadata:
              name: kuberoapps.application.kubero.dev
            spec:
              group: application.kubero.dev
              names:
                kind: KuberoApp
                listKind: KuberoAppList
                plural: kuberoapps
                singular: kuberoapp
              scope: Namespaced
              versions:
              - name: v1alpha1
                schema:
                  openAPIV3Schema:
                    description: KuberoApp is the Schema for the kuberoapps API
                    properties:
                      apiVersion:
                        description: 'APIVersion defines the versioned schema of this representation
                          of an object. Servers should convert recognized schemas to the latest
                          internal value, and may reject unrecognized values. More info: https://git.k8s.io/community/contributors/devel/sig-architecture/api-conventions.md#resources'
                        type: string
                      kind:
                        description: 'Kind is a string value representing the REST resource this
                          object represents. Servers may infer this from the endpoint the client
                          submits requests to. Cannot be updated. In CamelCase. More info: https://git.k8s.io/community/contributors/devel/sig-architecture/api-conventions.md#types-kinds'
                        type: string
                      metadata:
                        type: object
                      spec:
                        description: Spec defines the desired state of KuberoApp
                        type: object
                        x-kubernetes-preserve-unknown-fields: true
                      status:
                        description: Status defines the observed state of KuberoApp
                        type: object
                        x-kubernetes-preserve-unknown-fields: true
                    type: object
                served: true
                storage: true
                subresources:
                  status: {}
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # kubectl_manifest.kubero_operator[7] will be created
+ resource "kubectl_manifest" "kubero_operator" {
      + api_version             = "apiextensions.k8s.io/v1"
      + apply_only              = false
      + field_manager           = "kubectl"
      + force_conflicts         = true
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "CustomResourceDefinition"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "kuberobuilds.application.kubero.dev"
      + namespace               = (known after apply)
      + server_side_apply       = true
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = false
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: apiextensions.k8s.io/v1
            kind: CustomResourceDefinition
            metadata:
              name: kuberobuilds.application.kubero.dev
            spec:
              group: application.kubero.dev
              names:
                kind: KuberoBuild
                listKind: KuberoBuildList
                plural: kuberobuilds
                singular: kuberobuild
              scope: Namespaced
              versions:
              - name: v1alpha1
                schema:
                  openAPIV3Schema:
                    description: KuberoBuild is the Schema for the kuberobuilds API
                    properties:
                      apiVersion:
                        description: 'APIVersion defines the versioned schema of this representation
                          of an object. Servers should convert recognized schemas to the latest
                          internal value, and may reject unrecognized values. More info: https://git.k8s.io/community/contributors/devel/sig-architecture/api-conventions.md#resources'
                        type: string
                      kind:
                        description: 'Kind is a string value representing the REST resource this
                          object represents. Servers may infer this from the endpoint the client
                          submits requests to. Cannot be updated. In CamelCase. More info: https://git.k8s.io/community/contributors/devel/sig-architecture/api-conventions.md#types-kinds'
                        type: string
                      metadata:
                        type: object
                      spec:
                        description: Spec defines the desired state of KuberoBuild
                        type: object
                        x-kubernetes-preserve-unknown-fields: true
                      status:
                        description: Status defines the observed state of KuberoBuild
                        type: object
                        x-kubernetes-preserve-unknown-fields: true
                    type: object
                served: true
                storage: true
                subresources:
                  status: {}
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # kubectl_manifest.kubero_operator[8] will be created
+ resource "kubectl_manifest" "kubero_operator" {
      + api_version             = "apiextensions.k8s.io/v1"
      + apply_only              = false
      + field_manager           = "kubectl"
      + force_conflicts         = true
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "CustomResourceDefinition"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "kuberocouchdbs.application.kubero.dev"
      + namespace               = (known after apply)
      + server_side_apply       = true
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = false
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: apiextensions.k8s.io/v1
            kind: CustomResourceDefinition
            metadata:
              name: kuberocouchdbs.application.kubero.dev
            spec:
              group: application.kubero.dev
              names:
                kind: KuberoCouchDB
                listKind: KuberoCouchDBList
                plural: kuberocouchdbs
                singular: kuberocouchdb
              scope: Namespaced
              versions:
              - name: v1alpha1
                schema:
                  openAPIV3Schema:
                    description: KuberoCouchDB is the Schema for the kuberocouchdbs API
                    properties:
                      apiVersion:
                        description: 'APIVersion defines the versioned schema of this representation
                          of an object. Servers should convert recognized schemas to the latest
                          internal value, and may reject unrecognized values. More info: https://git.k8s.io/community/contributors/devel/sig-architecture/api-conventions.md#resources'
                        type: string
                      kind:
                        description: 'Kind is a string value representing the REST resource this
                          object represents. Servers may infer this from the endpoint the client
                          submits requests to. Cannot be updated. In CamelCase. More info: https://git.k8s.io/community/contributors/devel/sig-architecture/api-conventions.md#types-kinds'
                        type: string
                      metadata:
                        type: object
                      spec:
                        description: Spec defines the desired state of KuberoCouchDB
                        type: object
                        x-kubernetes-preserve-unknown-fields: true
                      status:
                        description: Status defines the observed state of KuberoCouchDB
                        type: object
                        x-kubernetes-preserve-unknown-fields: true
                    type: object
                served: true
                storage: true
                subresources:
                  status: {}
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # kubectl_manifest.kubero_operator[9] will be created
+ resource "kubectl_manifest" "kubero_operator" {
      + api_version             = "apiextensions.k8s.io/v1"
      + apply_only              = false
      + field_manager           = "kubectl"
      + force_conflicts         = true
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "CustomResourceDefinition"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "kuberoelasticsearches.application.kubero.dev"
      + namespace               = (known after apply)
      + server_side_apply       = true
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = false
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: apiextensions.k8s.io/v1
            kind: CustomResourceDefinition
            metadata:
              name: kuberoelasticsearches.application.kubero.dev
            spec:
              group: application.kubero.dev
              names:
                kind: KuberoElasticsearch
                listKind: KuberoElasticsearchList
                plural: kuberoelasticsearches
                singular: kuberoelasticsearch
              scope: Namespaced
              versions:
              - name: v1alpha1
                schema:
                  openAPIV3Schema:
                    description: KuberoElasticsearch is the Schema for the kuberoelasticsearches
                      API
                    properties:
                      apiVersion:
                        description: 'APIVersion defines the versioned schema of this representation
                          of an object. Servers should convert recognized schemas to the latest
                          internal value, and may reject unrecognized values. More info: https://git.k8s.io/community/contributors/devel/sig-architecture/api-conventions.md#resources'
                        type: string
                      kind:
                        description: 'Kind is a string value representing the REST resource this
                          object represents. Servers may infer this from the endpoint the client
                          submits requests to. Cannot be updated. In CamelCase. More info: https://git.k8s.io/community/contributors/devel/sig-architecture/api-conventions.md#types-kinds'
                        type: string
                      metadata:
                        type: object
                      spec:
                        description: Spec defines the desired state of KuberoElasticsearch
                        type: object
                        x-kubernetes-preserve-unknown-fields: true
                      status:
                        description: Status defines the observed state of KuberoElasticsearch
                        type: object
                        x-kubernetes-preserve-unknown-fields: true
                    type: object
                served: true
                storage: true
                subresources:
                  status: {}
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # kubectl_manifest.kubero_operator[10] will be created
+ resource "kubectl_manifest" "kubero_operator" {
      + api_version             = "apiextensions.k8s.io/v1"
      + apply_only              = false
      + field_manager           = "kubectl"
      + force_conflicts         = true
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "CustomResourceDefinition"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "kuberoes.application.kubero.dev"
      + namespace               = (known after apply)
      + server_side_apply       = true
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = false
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: apiextensions.k8s.io/v1
            kind: CustomResourceDefinition
            metadata:
              name: kuberoes.application.kubero.dev
            spec:
              group: application.kubero.dev
              names:
                kind: Kubero
                listKind: KuberoList
                plural: kuberoes
                singular: kubero
              scope: Namespaced
              versions:
              - name: v1alpha1
                schema:
                  openAPIV3Schema:
                    description: Kubero is the Schema for the kuberoes API
                    properties:
                      apiVersion:
                        description: 'APIVersion defines the versioned schema of this representation
                          of an object. Servers should convert recognized schemas to the latest
                          internal value, and may reject unrecognized values. More info: https://git.k8s.io/community/contributors/devel/sig-architecture/api-conventions.md#resources'
                        type: string
                      kind:
                        description: 'Kind is a string value representing the REST resource this
                          object represents. Servers may infer this from the endpoint the client
                          submits requests to. Cannot be updated. In CamelCase. More info: https://git.k8s.io/community/contributors/devel/sig-architecture/api-conventions.md#types-kinds'
                        type: string
                      metadata:
                        type: object
                      spec:
                        description: Spec defines the desired state of Kubero
                        type: object
                        x-kubernetes-preserve-unknown-fields: true
                      status:
                        description: Status defines the observed state of Kubero
                        type: object
                        x-kubernetes-preserve-unknown-fields: true
                    type: object
                served: true
                storage: true
                subresources:
                  status: {}
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # kubectl_manifest.kubero_operator[11] will be created
+ resource "kubectl_manifest" "kubero_operator" {
      + api_version             = "apiextensions.k8s.io/v1"
      + apply_only              = false
      + field_manager           = "kubectl"
      + force_conflicts         = true
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "CustomResourceDefinition"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "kuberokafkas.application.kubero.dev"
      + namespace               = (known after apply)
      + server_side_apply       = true
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = false
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: apiextensions.k8s.io/v1
            kind: CustomResourceDefinition
            metadata:
              name: kuberokafkas.application.kubero.dev
            spec:
              group: application.kubero.dev
              names:
                kind: KuberoKafka
                listKind: KuberoKafkaList
                plural: kuberokafkas
                singular: kuberokafka
              scope: Namespaced
              versions:
              - name: v1alpha1
                schema:
                  openAPIV3Schema:
                    description: KuberoKafka is the Schema for the kuberokafkas API
                    properties:
                      apiVersion:
                        description: 'APIVersion defines the versioned schema of this representation
                          of an object. Servers should convert recognized schemas to the latest
                          internal value, and may reject unrecognized values. More info: https://git.k8s.io/community/contributors/devel/sig-architecture/api-conventions.md#resources'
                        type: string
                      kind:
                        description: 'Kind is a string value representing the REST resource this
                          object represents. Servers may infer this from the endpoint the client
                          submits requests to. Cannot be updated. In CamelCase. More info: https://git.k8s.io/community/contributors/devel/sig-architecture/api-conventions.md#types-kinds'
                        type: string
                      metadata:
                        type: object
                      spec:
                        description: Spec defines the desired state of KuberoKafka
                        type: object
                        x-kubernetes-preserve-unknown-fields: true
                      status:
                        description: Status defines the observed state of KuberoKafka
                        type: object
                        x-kubernetes-preserve-unknown-fields: true
                    type: object
                served: true
                storage: true
                subresources:
                  status: {}
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # kubectl_manifest.kubero_operator[12] will be created
+ resource "kubectl_manifest" "kubero_operator" {
      + api_version             = "apiextensions.k8s.io/v1"
      + apply_only              = false
      + field_manager           = "kubectl"
      + force_conflicts         = true
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "CustomResourceDefinition"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "kuberomails.application.kubero.dev"
      + namespace               = (known after apply)
      + server_side_apply       = true
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = false
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: apiextensions.k8s.io/v1
            kind: CustomResourceDefinition
            metadata:
              name: kuberomails.application.kubero.dev
            spec:
              group: application.kubero.dev
              names:
                kind: KuberoMail
                listKind: KuberoMailList
                plural: kuberomails
                singular: kuberomail
              scope: Namespaced
              versions:
              - name: v1alpha1
                schema:
                  openAPIV3Schema:
                    description: KuberoMail is the Schema for the kuberomails API
                    properties:
                      apiVersion:
                        description: 'APIVersion defines the versioned schema of this representation
                          of an object. Servers should convert recognized schemas to the latest
                          internal value, and may reject unrecognized values. More info: https://git.k8s.io/community/contributors/devel/sig-architecture/api-conventions.md#resources'
                        type: string
                      kind:
                        description: 'Kind is a string value representing the REST resource this
                          object represents. Servers may infer this from the endpoint the client
                          submits requests to. Cannot be updated. In CamelCase. More info: https://git.k8s.io/community/contributors/devel/sig-architecture/api-conventions.md#types-kinds'
                        type: string
                      metadata:
                        type: object
                      spec:
                        description: Spec defines the desired state of KuberoMail
                        type: object
                        x-kubernetes-preserve-unknown-fields: true
                      status:
                        description: Status defines the observed state of KuberoMail
                        type: object
                        x-kubernetes-preserve-unknown-fields: true
                    type: object
                served: true
                storage: true
                subresources:
                  status: {}
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # kubectl_manifest.kubero_operator[13] will be created
+ resource "kubectl_manifest" "kubero_operator" {
      + api_version             = "apiextensions.k8s.io/v1"
      + apply_only              = false
      + field_manager           = "kubectl"
      + force_conflicts         = true
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "CustomResourceDefinition"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "kuberomemcacheds.application.kubero.dev"
      + namespace               = (known after apply)
      + server_side_apply       = true
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = false
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: apiextensions.k8s.io/v1
            kind: CustomResourceDefinition
            metadata:
              name: kuberomemcacheds.application.kubero.dev
            spec:
              group: application.kubero.dev
              names:
                kind: KuberoMemcached
                listKind: KuberoMemcachedList
                plural: kuberomemcacheds
                singular: kuberomemcached
              scope: Namespaced
              versions:
              - name: v1alpha1
                schema:
                  openAPIV3Schema:
                    description: KuberoMemcached is the Schema for the kuberomemcacheds API
                    properties:
                      apiVersion:
                        description: 'APIVersion defines the versioned schema of this representation
                          of an object. Servers should convert recognized schemas to the latest
                          internal value, and may reject unrecognized values. More info: https://git.k8s.io/community/contributors/devel/sig-architecture/api-conventions.md#resources'
                        type: string
                      kind:
                        description: 'Kind is a string value representing the REST resource this
                          object represents. Servers may infer this from the endpoint the client
                          submits requests to. Cannot be updated. In CamelCase. More info: https://git.k8s.io/community/contributors/devel/sig-architecture/api-conventions.md#types-kinds'
                        type: string
                      metadata:
                        type: object
                      spec:
                        description: Spec defines the desired state of KuberoMemcached
                        type: object
                        x-kubernetes-preserve-unknown-fields: true
                      status:
                        description: Status defines the observed state of KuberoMemcached
                        type: object
                        x-kubernetes-preserve-unknown-fields: true
                    type: object
                served: true
                storage: true
                subresources:
                  status: {}
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # kubectl_manifest.kubero_operator[14] will be created
+ resource "kubectl_manifest" "kubero_operator" {
      + api_version             = "apiextensions.k8s.io/v1"
      + apply_only              = false
      + field_manager           = "kubectl"
      + force_conflicts         = true
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "CustomResourceDefinition"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "kuberomongodbs.application.kubero.dev"
      + namespace               = (known after apply)
      + server_side_apply       = true
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = false
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: apiextensions.k8s.io/v1
            kind: CustomResourceDefinition
            metadata:
              name: kuberomongodbs.application.kubero.dev
            spec:
              group: application.kubero.dev
              names:
                kind: KuberoMongoDB
                listKind: KuberoMongoDBList
                plural: kuberomongodbs
                singular: kuberomongodb
              scope: Namespaced
              versions:
              - name: v1alpha1
                schema:
                  openAPIV3Schema:
                    description: KuberoMongoDB is the Schema for the kuberomongodbs API
                    properties:
                      apiVersion:
                        description: 'APIVersion defines the versioned schema of this representation
                          of an object. Servers should convert recognized schemas to the latest
                          internal value, and may reject unrecognized values. More info: https://git.k8s.io/community/contributors/devel/sig-architecture/api-conventions.md#resources'
                        type: string
                      kind:
                        description: 'Kind is a string value representing the REST resource this
                          object represents. Servers may infer this from the endpoint the client
                          submits requests to. Cannot be updated. In CamelCase. More info: https://git.k8s.io/community/contributors/devel/sig-architecture/api-conventions.md#types-kinds'
                        type: string
                      metadata:
                        type: object
                      spec:
                        description: Spec defines the desired state of KuberoMongoDB
                        type: object
                        x-kubernetes-preserve-unknown-fields: true
                      status:
                        description: Status defines the observed state of KuberoMongoDB
                        type: object
                        x-kubernetes-preserve-unknown-fields: true
                    type: object
                served: true
                storage: true
                subresources:
                  status: {}
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # kubectl_manifest.kubero_operator[15] will be created
+ resource "kubectl_manifest" "kubero_operator" {
      + api_version             = "apiextensions.k8s.io/v1"
      + apply_only              = false
      + field_manager           = "kubectl"
      + force_conflicts         = true
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "CustomResourceDefinition"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "kuberomysqls.application.kubero.dev"
      + namespace               = (known after apply)
      + server_side_apply       = t
```
</details>
<br>

**Warning**: Output length greater than max comment size. Continued in next comment.